// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.

Console.Write("Введите число от 1 до 7, обозначающее день, где 1 - Понедельник: ");
int DayNumber = Convert.ToInt32(Console.ReadLine());
